[
  {
    "id": 1,
    "model": "VP21001",
    "name": "VIRIX PRO Heavy-Duty Air Jack",
    "images": [
      "/images/portfolio/VP21001/VP21001.jpg",
      "/images/portfolio/VP21001/VP21001 (2).jpg",
      "/images/portfolio/VP21001/VP21001 (3).jpg",
      "/images/portfolio/VP21001/VP21001 (4).jpg"
    ],
    "description": "Easily Lift Up to Three Tons\n\nWith its ability to raise up to 3000 kg (11,000 lbs), this air jack is perfect for trucks, SUVs, and off-road vehicles. Its sturdy construction guarantees dependable and strong lifting for any off-road or vehicle repair requirements.\n\nOverpressure Protection Safety Valve\n\nThe automated safety valve, which releases air when needed to prevent over-pressurization, will keep you safe when using elevators. This function gives you confidence when working on your car by adding a crucial layer of safety.\n\nQuick Lifting Action\n\nThis air jack is ideal for off-road adjustments or fast tire changes because of its incredibly quick lift capability, which minimizes downtime. Power and efficiency combine to provide you a dependable, fast tool for any lifting job.",
    "specifications": {
      "Capacity": "3 Ton (3000 kg / 11,000 lbs)",
      "Safety Valve": "Overpressure Protection Safety Valve",
      "Lifting Speed": "Incredibly Quick Lift Action",
      "Ideal For": "Trucks, SUVs, Off-Road Vehicles"
    }
  },
  {
    "id": 2,
    "model": "VP21002",
    "name": "VIRIX PRO Air Jack with Movable Arm",
    "images": [
      "/images/portfolio/VP21002/VP21002.jpg",
      "/images/portfolio/VP21002/VP21002 (2).jpg",
      "/images/portfolio/VP21002/VP21002 (3).jpg"
    ],
    "description": "A strong lifting capacity of up to three tons\n\nThis air jack is the perfect tool for trucks, SUVs, and off-road vehicles because it can raise up to 3000 kg (11,000 lbs). Whether you're working on rough terrain or in a garage, this jack guarantees quick and simple vehicle lifting.\n\nProtective Safety Valve\n\nMaximum protection while in use is ensured by the air jack's integrated safety valve, which immediately releases air when pressure exceeds the safe limit. Even under difficult circumstances, you can depend on it for both safety and power.\n\nQuick Lift & Simple Operation\n\nThis air jack completes the task swiftly because of its incredibly quick lifting action. Additionally, it has a movable arm that makes it simple to position and adjust the jack, particularly in difficult-to-reach places. Ideal for professional mechanics and off-road enthusiasts who require efficiency and versatility.",
    "specifications": {
      "Capacity": "3 Ton (3000 kg / 11,000 lbs)",
      "Safety Valve": "Integrated Safety Valve",
      "Movable Arm": "Yes",
      "Ideal For": "Professional Mechanics, Off-Road Enthusiasts"
    }
  },
  {
    "id": 3,
    "model": "VP21003",
    "name": "VIRIX PRO Soft Shackle",
    "images": [
      "/images/portfolio/VP21003/VP21003.jpg",
      "/images/portfolio/VP21003/VP21003 (2).jpg",
      "/images/portfolio/VP21003/VP21003 (3).jpg",
      "/images/portfolio/VP21003/VP21003 (4).jpg"
    ],
    "description": "Breaking Strength Unmatched (18,000 kg)\n\nThe VIRIX PRO Soft Shackle, made for off-road recovery, offers strength like no other. With an impressive 18-ton breaking strength, this shackle is designed to withstand the most demanding recovery scenarios, guaranteeing dependability when you need it most.\n\nImproved Safety Features\n\nWhen it comes to recovery activities, safety is crucial. There would be less chance of harm if the shackle broke because it would fall harmlessly. Compared to conventional metal shackles, this characteristic makes it a safer option, allowing you to work with confidence.\n\nCompact & Lightweight Design\n\nThis soft shackle's small size and light weight make it easy to store and offer practical space-saving options for your off-road equipment. When packing on your next trip, you won't have to worry about bringing too much luggage.\n\nKeep Your Car Safe\n\nThe VIRIX PRO Soft Shackle's pliable and soft construction shields the paint of your car while it's being recovered. It's perfect for off-road enthusiasts who value automobile maintenance because you can recover without worrying about harming your vehicle.",
    "specifications": {
      "Breaking Strength": "18 Ton (18,000 kg)",
      "Safety Features": "Falls Harmlessly If Broken",
      "Design": "Compact & Lightweight",
      "Vehicle Protection": "Pliable and Soft Construction"
    }
  },
  {
    "id": 4,
    "model": "VP21004",
    "name": "VIRIX PRO 19MM Pulling Rope",
    "images": [
      "/images/portfolio/VP21004/VP21004.jpg",
      "/images/portfolio/VP21004/VP21004 (2).jpg",
      "/images/portfolio/VP21004/VP21004 (3).jpg",
      "/images/portfolio/VP21004/VP21004 (4).jpg"
    ],
    "description": "Safe and Easy Recuperation\n\nThe VIRIX PRO 19MM Pulling Rope was created specifically for off-road recovery. Its ability to stretch and absorb shock reduces the amount of strain that recovery operations place on your vehicles. Get a more seamless, jerk-free experience that protects your car and you.\n\nStrong Pulling Ability\n\nThis rope's remarkable 8.3-ton pulling capacity makes it perfect for off-road cars and SUVs. Avoid becoming stranded in difficult circumstances; this sturdy rope will carry you through the worst.\n\nSturdy Design\n\nThe VIRIX PRO pulling rope is made to last thanks to its protective webbing and premium rip-resistant nylon construction. It is a necessary equipment for off-road adventures because of its sturdy design, which guarantees dependable performance even in the most trying circumstances.\n\nOutstanding Rate of Extension\n\nWith an extension rate of up to 30%, this rope provides improved shock absorption while recovering. This dynamic elasticity lessens the possibility of unexpected shocks damaging your car or machinery.\n\nSimple to Use\n\nThis 9-meter-long rope offers the best reach while being lightweight for effortless handling. Safety is improved by the red color's high visibility, which makes it simple to identify in low light or emergency situations.\n\nManaged Recuperation\n\nUse the VIRIX PRO dynamic kinetic rope to recuperate in a regulated manner. Because of its design, it operates more smoothly, guaranteeing the effectiveness and safety of your recovery efforts.",
    "specifications": {
      "Pulling Capacity": "8.3 Ton",
      "Material": "Rip-Resistant Nylon with Protective Webbing",
      "Extension Rate": "Up to 30%",
      "Length": "9 meters",
      "Color": "Red (High Visibility)"
    }
  },
  {
    "id": 5,
    "model": "VP21005",
    "name": "VIRIX PRO 22MM Pulling Rope",
    "images": [
      "/images/portfolio/VP21005/VP21005.jpg",
      "/images/portfolio/VP21005/VP21005 (2).jpg",
      "/images/portfolio/VP21005/VP21005 (3).jpg",
      "/images/portfolio/VP21005/VP21005 (4).jpg"
    ],
    "description": "Safe and Easy Recuperation\n\nBecause of its ability to stretch and absorb shock, the VIRIX PRO 22MM Pulling Rope makes off-road recovery easy and stress-free. Its design protects the vehicle and the recovery equipment by reducing the strain on your car during difficult recoveries.\n\nStrong Pulling Ability\n\nThis rope is perfect for SUVs, trucks, and other off-road vehicles because it can tackle the most difficult recovery circumstances with its 10.8-ton pulling capability. This high-strength rope is ideal for situations where you're stuck in difficult terrain.\n\nSturdy Design\n\nConstructed from rip-resistant nylon and shielded by premium webbing, this pulling rope is made to last in harsh environments. Even under the most trying off-road conditions, its sturdy design guarantees dependable operation.\n\nOutstanding Rate of Extension\n\nWith an extension rate of up to 30%, this dynamic rope lessens the possibility of harming your car by absorbing the shock of recovery efforts. This kinetic rope's elasticity enables controlled, fluid recovery movements.\n\nSimple to Use\n\nThe 9-meter-long VIRIX PRO Pulling Rope is lightweight for effortless handling and provides an ideal reach. Safety is ensured by its high visibility red hue, which makes it simple to identify even in difficult or low-light situations."
    ,
    "specifications": {
      "Pulling Capacity": "10.8 Ton",
      "Material": "Rip-Resistant Nylon with Premium Webbing",
      "Extension Rate": "Up to 30%",
      "Length": "9 meters",
      "Color": "Red (High Visibility)"
    }
  },
  {
    "id": 6,
    "model": "VP21006",
    "name": "VIRIX PRO 32MM Pulling Rope",
    "images": [
      "/images/portfolio/VP21006/VP21006.jpg",
      "/images/portfolio/VP21006/VP21006 (2).jpg",
      "/images/portfolio/VP21006/VP21006 (3).jpg",
      "/images/portfolio/VP21006/VP21006 (4).jpg"
    ],
    "description": "Safe and Easy Recuperation\n\nThe VIRIX PRO 32MM Pulling Rope is designed to absorb as much shock as possible, resulting in a safe and easy vehicle recovery. This sturdy rope stretches to lessen the strain on your car during difficult off-road recoveries, making it safer to use in challenging circumstances.\n\nStrong Pulling Ability\n\nThis 21-ton rope is ideal for big SUVs, trucks, and other heavy off-road vehicles because it is made for harsh off-road environments. This rope will give you the strength and dependability you need while you're in the most difficult situations.\n\nSturdy Design\n\nWith its protective webbing and rip-resistant nylon construction, the VIRIX PRO pulling rope provides unparalleled performance and longevity. You will be well-prepared for off-road recoveries because it is made to endure severe situations and provide enduring dependability.\n\nOutstanding Rate of Extension\n\nThis kinetic rope reduces the startling effects of recovery by absorbing shocks with an extension rate of up to 30%. Dynamic elasticity ensures a regulated recovery experience by preventing unexpected shocks that could harm your car.\n\nSimple to Use\n\nThis rope, which is 9 meters (30 feet) long, offers the best reach while being lightweight for effortless handling. Its red high-visibility hue improves safety by making it simple to find in low-visibility situations or during crises."
    ,
    "specifications": {
      "Pulling Capacity": "21 Ton",
      "Material": "Rip-Resistant Nylon with Protective Webbing",
      "Extension Rate": "Up to 30%",
      "Length": "9 meters",
      "Color": "Red (High Visibility)"
    }
  },
  {
    "id": 7,
    "model": "VP21007",
    "name": "VIRIX PRO 38MM Pulling Rope",
    "images": [
      "/images/portfolio/VP21007/VP21007.jpg",
      "/images/portfolio/VP21007/VP21007 (2).jpg"
    ],
    "description": "Superior Breaking Power\n\nOne of the strongest ropes for extreme off-road recoveries is the VIRIX PRO 38MM Pulling Rope, which has an amazing breaking strength of 30 tons (66,000 lbs). This rope is designed to tackle the most difficult jobs, whether you're rescuing SUVs, big trucks, or heavy machinery.\n\nSturdy and Sturdy Construction\n\nFor optimum durability, this pulling rope is made with premium rip-resistant nylon and protective webbing. In addition to enhancing its visual appeal, the black head and red wire (Pantone 485C/2305C) guarantee enduring performance in demanding settings.\n\nRecovery Absorbing Shock\n\nThis kinetic rope is designed to stretch to absorb shock and reduce vehicle stress during recovery, with an extension rate of up to 30%. This adaptability makes the recovery procedure safer by lowering the possibility of unexpected shocks that could harm the rope and the car.\n\nIdeal Length & Simple Handling\n\nThe rope's 9-meter (30-foot) length provides sufficient reach for recovery scenarios, and its lightweight construction makes handling and setup simple. It is essential for any off-road excursion since the carrying bag that comes with it guarantees easy storage and portability.\n\nHigh Safety Visibility\n\nDuring recovery efforts, the high-visibility red color improves safety and efficiency by enabling prompt identification in challenging terrain or low light levels.\n\nManaged, Error-Free Recuperation\n\nThe VIRIX PRO 38MM Pulling Rope provides a controlled and seamless recovery process because of its dynamic features. This makes it the ideal instrument for securely overcoming off-road recovery obstacles while guaranteeing dependability each and every time.",
    "specifications": {
      "Breaking Strength": "30 Ton (66,000 lbs)",
      "Material": "Rip-Resistant Nylon with Protective Webbing",
      "Extension Rate": "Up to 30%",
      "Length": "9 meters (30 feet)",
      "Color": "Black Head with Red Wire (Pantone 485C/2305C)"
    }
  },
  {
    "id": 8,
    "model": "VP21008",
    "name": "VIRIX PRO 3.8L Fuel Tank",
    "images": [
      "/images/portfolio/VP21008/VP21008.jpg",
      "/images/portfolio/VP21008/VP21008 (2).jpg",
      "/images/portfolio/VP21008/VP21008.png"
    ],
    "description": "Sturdy and Leak-Proof Design\n\nFor optimal longevity, this 3.8L fuel tank is made of high-density polyethylene with incredibly thick walls. For all of your off-road excursions, it offers safe and durable gasoline storage because it is impervious to rust and corrosion.\n\nSmall 1. Capacity in Gallon\n\nWith a 1-gallon capacity, this tank is small enough to fit easily in your off-road vehicle and provides enough gasoline storage for long travels. It's the ideal size to guarantee you have adequate fuel without taking up a lot of room.\n\nFuel Transfer Without Mess\n\nClean and easy gasoline transfer is made possible by the flexible filling hose and integrated fuel pipe. When filling your car on the trail or during recovery, you don't have to be concerned about spills or mess.\n\nPortable and Lightweight\n\nThis fuel tank is lightweight, easy to carry, and designed for portability, making it the ideal addition to your off-road equipment. Additionally, it's simple to store, making the most of the space in your car.\n\nMultiple Uses\n\nIn addition to securing gasoline for your off-road excursions, the 3.8L fuel tank might be useful in emergency car recovery scenarios. No matter where your adventures lead you, keep your car fueled and prepared for everything.",
    "specifications": {
      "Capacity": "3.8L (1 Gallon)",
      "Material": "High-Density Polyethylene",
      "Fuel Pipe": "Built-In",
      "Features": "Leak-Proof, Rust and Corrosion Resistant",
      "Portability": "Lightweight and Easy to Carry"
    }
  },
  {
    "id": 9,
    "model": "VP21009",
    "name": "VIRIX PRO 7.6L Fuel Tank",
    "images": [
      "/images/portfolio/VP21009/VP21009.jpg",
      "/images/portfolio/VP21009/VP21009.png"
    ],
    "description": "Sturdy and Leak-Proof Design\n\nThe ultra-thick walls and high-density polyethylene construction of the 7.6L fuel tank provide superior resistance to corrosion and rust. This guarantees that, regardless of the circumstances, your fuel is kept safe and sound.\n\nSmall 2. Capacity in Gallon\n\nThis fuel tank holds two gallons, which is sufficient for long off-road excursions. It is perfect for people who need more fuel without giving up valuable room because it is made to be small enough to fit easily in your car.\n\nFuel Transfer Without Mess\n\nFuel transfer is easy and mess-free thanks to the flexible filling hose and built-in fuel pipe. Now that you may refuel without worrying about spills or interruptions, you can keep your car and the area around it clean while recovery or refueling is underway.\n\nPortable and Lightweight\n\nThis fuel tank is made to be easily carried and stored in your off-road vehicle because it is lightweight and portable. Because of its space-efficient design, it can be stowed comfortably without taking up more space.\n\nMultiple Uses\n\nThe 7.6L Fuel Tank can be helpful in vehicle recovery scenarios in addition to safely storing fuel for your off-road excursions. Regardless of the terrain, keep your car fueled and prepared for action.",
    "specifications": {
      "Capacity": "7.6L (2 Gallons)",
      "Material": "High-Density Polyethylene",
      "Fuel Pipe": "Built-In",
      "Features": "Leak-Proof, Corrosion and Rust Resistant",
      "Portability": "Lightweight and Easy to Carry"
    }
  },
  {
    "id": 10,
    "model": "VP21010",
    "name": "VIRIX PRO 9.6L Fuel Tank",
    "images": [
      "/images/portfolio/VP21010/VP21010.jpg",
      "/images/portfolio/VP21010/VP21010.png"
    ],
    "description": "Sturdy and Leak-Proof Design\n\nThe 9.6L Fuel Tank's ultra-thick walls and high-density polyethylene construction offer exceptional resistance to wear, corrosion, and rust. For your off-road requirements, this sturdy design guarantees long-lasting and secure fuel storage.\n\nAmple Capacity of 2.5 Gallon\n\nThis tank's 2.5-gallon capacity provides ample fuel for long off-road excursions, and its small size makes it simple to store in your car. Don't worry about running out of fuel when on off-road excursions.\n\nFuel Transfer Without Mess\n\nRefueling is quick and simple with this tank's integrated fuel pipe and flexible filling hose, which facilitate a clean and easy fuel transfer. During your off-road adventures or recovery scenarios, take pleasure in a clean refueling experience.\n\nPortable and Lightweight\n\nWith its lightweight and portable design, the 9.6L gasoline Tank lets you make the most of the space in your off-road vehicle without compromising gasoline storage. It's a handy addition to your equipment because of its small size.\n\nMultiple Uses\n\nThe 9.6L Fuel Tank provides safe fuel storage and adaptability for both long-distance off-road travel and vehicle recovery scenarios. Make sure your car is fueled and prepared for any journey.",
    "specifications": {
      "Capacity": "9.6L (2.5 Gallons)",
      "Material": "High-Density Polyethylene",
      "Fuel Pipe": "Built-In",
      "Features": "Leak-Proof, Corrosion and Rust Resistant",
      "Portability": "Lightweight and Portable"
    }
  },
  {
    "id": 11,
    "model": "VP21011",
    "name": "VIRIX PRO 11.4L Fuel Tank",
    "images": [
      "/images/portfolio/VP21011/VP21011.jpg",
      "/images/portfolio/VP21011/VP21011 (2).jpg"
    ],
    "description": "Strong and Leak-Proof Design\n\nBecause of its ultra-thick walls and high-density plastic construction, the 11.4L fuel tank is resistant to corrosion, rust, and damage from severe off-road situations. Your fuel will be safe for any expedition thanks to this sturdy structure, which offers secure fuel storage.\n\n3 Gallon Capacity, Large\n\nWith a 3-gallon capacity, this tank is small enough to fit in your car and provides enough gasoline storage for lengthy off-road excursions. Travel long distances without worrying about running out of fuel.\n\nEffective & Clean Fuel Transfer\n\nConveniently designed, the flexible filling hose and integrated fuel pipe facilitate a seamless fuel transfer, guaranteeing hassle-free and rapid refilling.\n\nPortable and Lightweight\n\nBecause of its portability and small weight, the 11.4L fuel tank is easy to carry and store in your off-road vehicle. You can always bring necessary fuel with you because of its small size, which maximizes space without sacrificing fuel capacity.\n\nMultiple Uses\n\nThis tank is ideal for safely storing fuel, guaranteeing that you're ready for any off-road excursions or auto recovery scenarios. This adaptable and sturdy fuel tank will keep your car prepared for anything.",
    "specifications": {
      "Capacity": "11.4L (3 Gallons)",
      "Material": "High-Density Plastic",
      "Fuel Pipe": "Built-In",
      "Features": "Leak-Proof, Corrosion and Rust Resistant",
      "Portability": "Lightweight and Easy to Carry"
    }
  },
  {
    "id": 12,
    "model": "VP21012",
    "name": "VIRIX PRO 18.9L Fuel Tank",
    "images": [
      "/images/portfolio/VP21012/VP21012.jpg",
      "/images/portfolio/VP21012/VP21012 (2).jpg"
    ],
    "description": "Strong and Leak-Proof Design\n\nThe 18.9L Fuel Tank's ultra-thick walls and high-density polyethylene construction offer exceptional resistance against corrosion and rust. This makes it the best choice for long-term, secure fuel storage in even the most challenging off-road conditions.\n\nBig 5. Capacity in Gallon\n\nThe 18.9L Fuel Tank's roomy 5-gallon capacity guarantees that you will have enough fuel for long off-road excursions, yet its small size still makes it simple to store in your car. Maintain your energy levels while moving around without taking up extra room.\n\nFuel Transfer Without Mess\n\nThe 18.9L gasoline Tank makes refueling easy with its flexible filling hose and integrated gasoline pipe. Spills are reduced by the rapid and effective fuel transfer, ensuring a hassle-free and clean off-road experience.\n\nPortable and Lightweight\n\nThe 18.9L Fuel Tank is lightweight and portable even with its increased capacity. You can take it wherever without worrying about storage thanks to its small size, which makes it perfect for making the most of the space in your off-road vehicle.\n\nMultiple Uses\n\nThis fuel tank is a great option for vehicle recovery and other off-road needs, so it's not just for off-road excursions. It is an essential piece of equipment for any expedition because of its safe fuel storage capabilities.",
    "specifications": {
      "Capacity": "18.9L (5 Gallons)",
      "Material": "High-Density Polyethylene",
      "Fuel Pipe": "Built-In",
      "Features": "Leak-Proof, Corrosion and Rust Resistant",
      "Portability": "Lightweight and Portable"
    }
  },
  {
    "id": 13,
    "model": "VP21013",
    "name": "VIRIX PRO 30L Fuel Tank",
    "images": [
      "/images/portfolio/VP21013/VP21013.jpg",
      "/images/portfolio/VP21013/VP21013 (2).jpg"
    ],
    "description": "Construction that is both durable and leak-proof\n\nThe 30L Fuel Tank is constructed from high-density plastic with ultra-thick walls, providing exceptional resistance to corrosion and oxidation. This guarantees enduring durability, rendering it the optimal solution for secure gasoline storage during off-road excursions.\n\nEight-gallon capacity\n\nThe 30L Fuel Tank is suitable for extended off-road excursions due to its 8-gallon capacity, and its compact design allows it to be easily stored in your vehicle's storage space. There is no need to be concerned about running out of petroleum during your expedition.\n\nFuel Transfer That Is Both Efficient and Clean\n\nThe vehicle can be refueled without spills due to the built-in fuel pipe and flexible filling hose, which facilitates a fast and clean process. The design guarantees effortless operation during both storage and replenishing, thereby ensuring a seamless off-road experience.\n\nPortable and Lightweight\n\nThe 30L Fuel Tank is both lightweight and portable, despite its larger size, making it effortless to transport on your voyage. Its design optimizes space efficiency, enabling effortless stowage in your off-road vehicle.\n\nVersatile Application\n\nFuel storage is not the sole function of this fuel canister; it is also ideal for vehicle recovery scenarios. Any off-road enthusiast seeking to maintain their preparedness will find it indispensable due to its secure and dependable fuel storage.",
    "specifications": {
      "Capacity": "30L (8 Gallons)",
      "Material": "High-Density Plastic",
      "Fuel Pipe": "Built-In",
      "Features": "Leak-Proof, Corrosion and Oxidation Resistant",
      "Portability": "Lightweight and Portable"
    }
  },
  {
    "id": 14,
    "model": "VP21014",
    "name": "VIRIX PRO Plastic Fuel Tank Bracket",
    "images": [
      "/images/portfolio/VP21014/VP21014.jpg",
      "/images/portfolio/VP21014/VP21014 (2).jpg",
      "/images/portfolio/VP21014/VP21014 (3).jpg"
    ],
    "description": "Safe and Steady\n\nThe VIRIX PRO Plastic Fuel Tank Bracket, made of premium steel, guarantees that your fuel can stay sturdy and safe on any surface. This bracket ensures that your fuel can remains in position during rough journeys, making it ideal for off-road excursions.\n\nFast-Fix Design\n\nThis bracket's convenient design allows for a simple installation and removal procedure. It's straightforward to operate and makes modifications simple when you need to go to your gasoline container.\n\nSturdy and Weatherproof\n\nThe bracket is weather-resistant and provides excellent protection from the elements thanks to its matte black finish. Because of its durable construction, you can rely on dependable performance on all of your off-road excursions.\n\nComplementary to All\n\nThis bracket is a flexible choice for a range of off-road vehicles because it is universally compatible and made to suit the majority of standard-sized gasoline cans.",
    "specifications": {
      "Material": "Premium Steel",
      "Design": "Fast-Fix, Easy Installation and Removal",
      "Finish": "Matte Black (Weather-Resistant)",
      "Compatibility": "Universal Fit for Standard-Sized Gasoline Cans",
      "Usage": "Roll Cages, Roof Racks, Cargo Spaces"
    }
  },
  {
    "id": 15,
    "model": "VP21015",
    "name": "VIRIX PRO 5L Fuel Tank with Automatic Shut-Off",
    "images": [
      "/images/portfolio/VP21015/VP21015.jpg"
    ],
    "description": "Mechanism for Automatic Shut-Off\n\nAn automated shut-off valve on the 5L fuel tank ensures fast and safe gasoline pouring without spills. By preventing overflows, this function keeps things tidy and hassle-free.\n\nPouring in Balance for Convenience\n\nThis fuel can ensures a smooth and regulated flow of petrol to your vehicle, ATV, or other necessary equipment thanks to its specifically proportioned rear handle.\n\nSelf-Venting to Pour Safer\n\nThis fuel tank's self-venting design makes pouring safer, lowers the possibility of fuel spills, and makes handling it easier in any situation.\n\nEnvironmentally Sustainable & Low Emissions\n\nRefueling with this fuel ensures lower emissions and environmental protection because it satisfies AS/NZS 2906:2001 and EAP criteria. For all off-road and leisure activities, it's an environmentally responsible option.\n\nAdaptable Use\n\nAn indispensable item for any explorer wishing to maintain their equipment on extended journeys, the 5L Fuel Tank is ideal for keeping your car, ATV, and other off-road vehicles fully charged.",
    "specifications": {
      "Capacity": "5L",
      "Features": "Automatic Shut-Off, Self-Venting",
      "Emission Standards": "AS/NZS 2906:2001 and EAP",
      "Handle": "Specifically Proportioned Rear Handle",
      "Usage": "Vehicles, ATVs, Off-Road Equipment"
    }
  },
  {
    "id": 16,
    "model": "VP21016",
    "name": "VIRIX PRO 10L Fuel Tank with Automatic Shut-Off",
    "images": [
      "/images/portfolio/VP21016/VP21016.jpg"
    ],
    "description": "Safety Features: Automatic Shut-Off\n\nWith its automated shut-off valve, the 10L Fuel Tank offers a safe and effective fueling experience. This feature guarantees a clean, spill-free operation each and every time by preventing overflows.\n\nControlled and Balanced Pouring\n\nWhen refueling your car, ATV, or other equipment, this fuel can's specifically proportioned rear handle guarantees balanced pouring, providing improved control and accuracy.\n\nEasy-to-use Self-Venting Design\n\nThis fuel tank's self-venting feature makes pouring smoother, lowers pressure buildup, and makes refueling safer and simpler.\n\nEco-Friendly & Lower Emissions\n\nReduces emissions and helps safeguard the environment by meeting AS/NZS 2906:2001 and EAP requirements. This fuel can is an environmentally beneficial choice for all of your fueling needs because it was made with the planet in mind.\n\nAdaptable and Useful\n\nFor servicing your vehicle, ATV, and other off-road equipment, the 10L fuel tank is ideal. Because it guarantees that you always have the gasoline you need for long travels, it's a necessary tool for any outdoor enthusiast.",
    "specifications": {
      "Capacity": "10L",
      "Features": "Automatic Shut-Off, Self-Venting",
      "Emission Standards": "AS/NZS 2906:2001 and EAP",
      "Handle": "Specifically Proportioned Rear Handle",
      "Usage": "Vehicles, ATVs, Off-Road Equipment"
    }
  },
  {
    "id": 17,
    "model": "VP21017",
    "name": "VIRIX PRO 20L Fuel Tank with Automatic Shut-Off",
    "images": [
      "/images/portfolio/VP21017/VP21017.jpg"
    ],
    "description": "Auto-Shut-Off for Clean and Safe Pouring\n\nBy automatically cutting off the flow as the tank fills up, the 20L Fuel Tank's automatic shut-off valve ensures a clean, spill-free filling experience.\n\nSmooth Pouring with Self-Venting\n\nA smooth and steady flow is made possible by the self-venting system of this fuel can, which lowers pressure buildup and facilitates safer and simpler refueling.\n\nErgonomic Design for User-Friendliness\n\nWhen refueling your vehicle, ATV, or other equipment, the precisely proportioned rear handle guarantees balanced pouring, providing you with control and accuracy.\n\nReduced Emissions and Environmentally Friendly\n\nThis fuel tank satisfies AS/NZS 2906:2001 and EAP standards and is made to minimize emissions, making it a green option for off-road adventures and outdoor enthusiasts.\n\nAdaptable and Useful\n\nThis 20L Fuel Tank is a crucial tool for lengthy travels or off-road activities, keeping your car, ATV, or other vital equipment fueled and ready for action.",
    "specifications": {
      "Capacity": "20L",
      "Features": "Automatic Shut-Off, Self-Venting",
      "Emission Standards": "AS/NZS 2906:2001 and EAP",
      "Handle": "Precisely Proportioned Rear Handle",
      "Usage": "Vehicles, ATVs, Off-Road Equipment"
    }
  },
  {
    "id": 18,
    "model": "VP21018",
    "name": "VIRIX PRO NSR13114 Rubber Clamps",
    "images": [
      "/images/portfolio/VP21018/VP21018.jpg",
      "/images/portfolio/VP21018/VP21018 (2).jpg",
      "/images/portfolio/VP21018/VP21018 (3).jpg",
      "/images/portfolio/VP21018/VP21018 (4).jpg",
      "/images/portfolio/VP21018/VP21018 (5).jpg",
      "/images/portfolio/VP21018/VP21018 (6).jpg",
      "/images/portfolio/VP21018/VP21018.png"
    ],
    "description": "Axes, shovels, rakes, and other tools with a diameter of 13 to 114 mm can be safely stored with the VIRIX PRO NSR13114 Rubber Clamps. These adaptable clamps guarantee that your tools remain firmly in place while being transported, making them perfect for use in trucks, SUVs, and off-road vehicles.\n\nSturdy Design\n\nThese clamps, which are made of durable transportation-grade rubber, are resistant to UV deterioration, ripping, and cracking, guaranteeing their dependable operation over time—even in challenging conditions.\n\nPerformance in Every Weather\n\nThe NSR13114 clamps are made to endure extreme cold and heat, and they work consistently in temperatures between -40°C and +80°C (-40°F and 176°F), making them appropriate for year-round use in a variety of regions.\n\nDesigning to Save Space\n\nEasily mounted to roll cages, roof racks, or cargo spaces, these clamps' small dimensions of 13cm x 6cm x 4cm (5.1\" x 2.4\" x 1.6\") allow you to safely store your equipment while conserving critical cargo space.\n\nSimple Installation\n\nIts no-drill design makes installation easy. Quick assembly and hassle-free tool storage are made possible by the pre-drilled holes that make it simple to bolt to secure mounting points (bolt not included).",
    "specifications": {
      "Tool Diameter Range": "13mm to 114mm",
      "Material": "Transportation-Grade Rubber",
      "Weather Resistance": "UV, Rip, Crack Resistant",
      "Temperature Range": "-40°C to +80°C (-40°F to 176°F)",
      "Dimensions": "13cm x 6cm x 4cm (5.1\" x 2.4\" x 1.6\")",
      "Installation": "No-Drill, Pre-Drilled Holes"
    }
  },
  {
    "id": 23,
    "model": "VP21023",
    "name": "VIRIX PRO Sand Plates (Black)",
    "images": [
      "/images/portfolio/VP21023/VP21023.jpg",
      "/images/portfolio/VP21023/VP21023 (2).jpg",
      "/images/portfolio/VP21023/VP21023 (3).jpg",
      "/images/portfolio/VP21023/VP21023 (4).jpg",
      "/images/portfolio/VP21023/VP21023 (5).jpg",
      "/images/portfolio/VP21023/VP21023 (6).jpg",
      "/images/portfolio/VP21023/VP21023 (7).jpg",
      "/images/portfolio/VP21023/VP21023 (8).jpg"
    ],
    "description": "Better Traction\n\nThese black sand plates are ideal for simple recovery in difficult off-road situations because of their textured surface, which offers superior traction on sand, mud, and snow.\n\n(Size: 43.3\" x 12.6\" x 0.47\"; 110 cm x 32 cm x 1.2 cm)\n\nUnbreakable Sturdiness\n\nThese sand plates' high-strength structure allows them to endure harsh circumstances and tremendous pressure, guaranteeing their long-term dependability and durability when you need them most.\n\nPortable and Lightweight\n\nThese plates, which weigh only 6.14 kg (13.5 lbs) per track, are a necessary piece of recovery equipment that doesn't take up much room in your car because they are portable and easy to store.",
    "specifications": {
      "Traction": "Superior on Sand, Mud, and Snow",
      "Dimensions": "43.3\" x 12.6\" x 0.47\" (110 cm x 32 cm x 1.2 cm)",
      "Weight": "6.14 kg (13.5 lbs) per track",
      "Material": "High-Strength Construction",
      "Portability": "Portable and Easy to Store"
    }
  },
  {
    "id": 24,
    "model": "VP21024",
    "name": "VIRIX PRO Sand Plates Black with Blue Track",
    "images": [
      "/images/portfolio/VP21024/VP21024.jpg",
      "/images/portfolio/VP21024/VP21024 (2).jpg",
      "/images/portfolio/VP21024/VP21024 (3).jpg",
      "/images/portfolio/VP21024/VP21024 (4).jpg",
      "/images/portfolio/VP21024/VP21024 (5).jpg",
      "/images/portfolio/VP21024/VP21024 (6).jpg"
    ],
    "description": "Better Traction\n\nThe blue-tracked black sand plates have a rough surface that improves traction on snow, mud, and sand. You can easily get back on the road using these recovery tracks, which are made for simple recovery in difficult off-road situations.\n\n(Size: 43.3\" x 12.6\" x 0.47\"; 110 cm x 32 cm x 1.2 cm)\n\nUnbreakable Sturdiness\n\nBecause they are made of materials with high strength and can tolerate high pressure, these sand plates are extremely resilient to wear and tear in harsh environments. These plates are capable of handling off-road trails and becoming trapped in mud.\n\nPortable and Lightweight\n\nThese sand plates are lightweight and portable, weighing only 6.14 kg (13.5 lbs) per track, making them easy to store and move around in your car. They provide off-road enthusiasts with an effective and compact alternative.\n\nAll-Use Fit\n\nThese sand plates are versatile for off-road use and are made to accommodate a range of vehicles. These tracks are essential for any off-road recovery package, regardless of whether you drive a truck, SUV, or other off-road vehicle.",
    "specifications": {
      "Traction": "Superior on Snow, Mud, and Sand",
      "Dimensions": "43.3\" x 12.6\" x 0.47\" (110 cm x 32 cm x 1.2 cm)",
      "Weight": "6.14 kg (13.5 lbs) per track",
      "Material": "High-Strength, Wear-Resistant",
      "Portability": "Lightweight and Portable",
      "Color": "Black with Blue Track"
    }
  },
  {
    "id": 25,
    "model": "VP21025",
    "name": "VIRIX PRO Red Sand Plates",
    "images": [
      "/images/portfolio/VP21025/VP21025.jpg",
      "/images/portfolio/VP21025/VP21025 (2).jpg",
      "/images/portfolio/VP21025/VP21025 (3).jpg",
      "/images/portfolio/VP21025/VP21025 (4).jpg",
      "/images/portfolio/VP21025/VP21025 (5).jpg",
      "/images/portfolio/VP21025/VP21025 (6).jpg"
    ],
    "description": "Better Traction\n\nThe rough surface of these red sand plates provides outstanding traction on sand, mud, and snow, which facilitates recovery in difficult off-road situations. They provide a dependable way out of difficult situations when you're stranded off-road.\n\n(Size: 43.3\" x 12.6\" x 0.47\"; 110 cm x 32 cm x 1.2 cm)\n\nUnbreakable Sturdiness\n\nBecause of their high-strength design, these sand plates are capable of withstanding severe pressure and adverse circumstances. In any off-road adventure, they offer long-lasting dependability and are robust enough for even the most difficult recovery chores.\n\nPortable and Lightweight\n\nThese red sand plates weigh only 6.14 kg (13.5 lbs) per track, making them portable and easy to stack in your car for easy transportation. They are the ideal complement to your off-road equipment because of their portability.\n\nAll-Use Fit\n\nThese sand plates are versatile because they are made to accommodate the majority of off-road vehicles. For all of your off-road recovery requirements, these plates are an essential item, regardless of whether you drive a truck, SUV, or 4x4.",
    "specifications": {
      "Traction": "Outstanding on Sand, Mud, and Snow",
      "Dimensions": "43.3\" x 12.6\" x 0.47\" (110 cm x 32 cm x 1.2 cm)",
      "Weight": "6.14 kg (13.5 lbs) per track",
      "Material": "High-Strength Design",
      "Portability": "Portable and Easy to Stack",
      "Color": "Red"
    }
  },
  {
    "id": 26,
    "model": "VP21026",
    "name": "VIRIX PRO Orange Sand Plates",
    "images": [
      "/images/portfolio/VP21026/VP21026.jpg",
      "/images/portfolio/VP21026/VP21026 (2).jpg",
      "/images/portfolio/VP21026/VP21026 (3).jpg",
      "/images/portfolio/VP21026/VP21026 (4).jpg",
      "/images/portfolio/VP21026/VP21026 (5).jpg",
      "/images/portfolio/VP21026/VP21026 (6).jpg"
    ],
    "description": "Better Traction\n\nThese orange sand plates, which are engineered with a textured surface, offer exceptional traction on sand, mud, and snow, guaranteeing a seamless and efficient recovery in off-road scenarios. These plates assist you in getting back on course whether you're trapped in wet muck or soft sand.\n\n(Size: 43.3\" x 12.6\" x 0.47\"; 110 cm x 32 cm x 1.2 cm)\n\nUnbreakable Sturdiness\n\nThese sand plates are made of high-strength materials and are intended to endure hard handling and strong pressure. Even in the most difficult recuperation situations, their long-lasting design ensures enduring performance.\n\nPortable and Lightweight\n\nThese orange sand plates fit easily in your car and are lightweight, weighing about 6.14 kg (13.5 lbs) per track. They are a vital piece of recovery equipment that doesn't take up much room because of their lightweight construction.\n\nAll-Use Fit\n\nThe majority of off-road vehicles may use these sand plates, guaranteeing their adaptability. They are the ideal choice for any off-road enthusiast in need of dependable recovery equipment, whether they are trucks or 4x4s.",
    "specifications": {
      "Traction": "Exceptional on Sand, Mud, and Snow",
      "Dimensions": "43.3\" x 12.6\" x 0.47\" (110 cm x 32 cm x 1.2 cm)",
      "Weight": "6.14 kg (13.5 lbs) per track",
      "Material": "High-Strength, Durable",
      "Portability": "Lightweight and Easy to Store",
      "Color": "Orange"
    }
  },
  {
    "id": 33,
    "model": "VP21033",
    "name": "VIRIX PRO NSR1528T+1528H Rubber Clamps",
    "images": [
      "/images/portfolio/VP21033/VP21033.jpg",
      "/images/portfolio/VP21033/VP21033 (2).jpg",
      "/images/portfolio/VP21033/VP21033 (3).jpg",
      "/images/portfolio/VP21033/VP21033 (4).jpg",
      "/images/portfolio/VP21033/VP21033 (5).jpg"
    ],
    "description": "Mount Large Tools Securely\n\nLarge, heavy tools can be safely held in place during transit with the VIRIX PRO NSR1528T+1528H Rubber Clamps. These clamps are ideal for attaching and storing your heavy-duty equipment on roll cages, roof racks, or cargo compartments because they suit all tool diameters.\n\nDedicated Rubber Structure\n\nThese clamps are made of transportation-grade rubber and are designed to withstand UV deterioration, ripping, and cracking. The durable material offers all-weather performance in temperatures between -40°C and +80°C (-40°F and 176°F), guaranteeing durability and dependability even under extreme circumstances.\n\nCompact and Space-Saving Design\n\nDespite their capacity to safely hold large instruments, the clamps' small size makes effective use of available space. These mounts maximize your available space while offering a firm grip, making them ideal for cars with little storage.\n\nSimple Installation That Doesn't Need Drilling\n\nThe pre-drilled holes that enable secure bolting to your mounting points make installation simple (note: bolts not included). Simply secure and you're set to go; no more drilling or intricate setups are required.",
    "specifications": {
      "Tool Diameter Range": "Up to All Tool Diameters",
      "Material": "Transportation-Grade Rubber",
      "Weather Resistance": "UV, Rip, Crack Resistant",
      "Temperature Range": "-40°C to +80°C (-40°F to 176°F)",
      "Design": "Compact and Space-Saving",
      "Installation": "No-Drill, Pre-Drilled Holes"
    }
  },
  {
    "id": 34,
    "model": "VP21034",
    "name": "VIRIX PRO NSR1635 Rubber Clamps",
    "images": [
      "/images/portfolio/VP21034/VP21034.jpg",
      "/images/portfolio/VP21034/VP21034 (2).jpg",
      "/images/portfolio/VP21034/VP21034 (3).jpg",
      "/images/portfolio/VP21034/VP21034 (4).jpg"
    ],
    "description": "Safe Storage for Tools\n\nTools with diameters between 16 and 32 mm can be safely held in place while being transported in your car, truck, or SUV with the VIRIX PRO NSR1635 Rubber Clamps. These clamps offer a dependable solution for tool organization on the road and are ideal for holding axes, shovels, rakes, fire extinguishers, and more.\n\nVersatile Use & Universal Fit\n\nThese clamps are the perfect answer for various storage requirements because they work with a large range of instruments. Whether you're fastening emergency supplies or arranging your camping kit, the universal fit guarantees adaptability to various tool kinds and vehicle layouts.\n\nSturdy Design\n\nThese clamps are made of durable, heavy-duty transport-grade rubber. They provide dependable performance even in harsh outdoor situations since they are resistant to tearing, cracking, and UV damage.\n\nPerformance in Every Weather\n\nBecause of its all-weather design, these clamps are dependable in both hot and cold regions. However, continuous exposure to direct sunlight is advised to preserve their performance and durability.\n\nSimple Installation\n\nNo drilling is necessary, and installation is quick and easy. Roll cages, roof racks, and cargo spaces can all be readily mounted with the clamps (note: mounting hardware is provided separately). You can quickly and easily set up and secure your tools thanks to our user-friendly design.",
    "specifications": {
      "Tool Diameter Range": "16mm to 32mm",
      "Material": "Heavy-Duty Transport-Grade Rubber",
      "Weather Resistance": "Tear, Crack, UV Resistant",
      "Design": "Universal Fit",
      "Installation": "No-Drill, Mounting Hardware Provided Separately"
    }
  },
  {
    "id": 35,
    "model": "VP21035",
    "name": "VIRIX PRO NSR2557 Rubber Clamps",
    "images": [
      "/images/portfolio/VP21035/VP21035.jpg",
      "/images/portfolio/VP21035/VP21035 (2).jpg",
      "/images/portfolio/VP21035/VP21035 (3).jpg",
      "/images/portfolio/VP21035/VP21035 (4).jpg",
      "/images/portfolio/VP21035/VP21035 (5).jpg",
      "/images/portfolio/VP21035/VP21035 (6).jpg"
    ],
    "description": "With tool diameters up to 57mm, the VIRIX PRO NSR2557 Rubber Clamps are specifically made to grip larger tools like axes, shovels, rakes, and more firmly. Your off-road equipment, camping tools, and emergency supplies may all be safely and securely stored with these clamps, which keep everything in place while you're moving.\n\nSturdy Design\n\nThese clamps are made of sturdy rubber and are designed to endure harsh environments. They are extremely resilient to UV rays, ripping, and cracking, guaranteeing enduring dependability even in harsh settings.\n\nPerformance in Every Weather\n\nThe NSR2557 clamps are perfect for both hot and cold weather because they are designed to function in a range of climates. However, it is advised to prevent extended exposure to direct sunlight in order to maintain their durability.\n\nDesigning to Save Space\n\nThese clamps can be installed on roll cages, roof racks, or cargo spaces without consuming critical storage space thanks to their small, space-efficient design. Ideal for optimizing cargo capacity and maintaining tool organization.\n\nSimple Installation\n\nDrilling is not necessary, and installation is quick and simple. These clamps provide a quick and easy option for on-the-go tool storage, firmly mounting in seconds to handle tools up to 57mm in diameter.",
    "specifications": {
      "Tool Diameter Range": "Up to 57mm",
      "Material": "Sturdy Rubber",
      "Weather Resistance": "UV, Rip, Crack Resistant",
      "Design": "Space-Saving",
      "Installation": "No-Drill, Quick and Simple"
    }
  },
  {
    "id": 36,
    "model": "VP21036",
    "name": "VIRIX PRO NSR4463 Rubber Clamps",
    "images": [
      "/images/portfolio/VP21036/VP21036.jpg",
      "/images/portfolio/VP21036/VP21036 (2).jpg",
      "/images/portfolio/VP21036/VP21036 (3).jpg",
      "/images/portfolio/VP21036/VP21036 (4).jpg",
      "/images/portfolio/VP21036/VP21036 (5).jpg"
    ],
    "description": "Larger tools like axes, shovels, and rakes may be safely held in place with the VIRIX PRO NSR4463 Rubber Clamps, offering off-roaders and explorers a dependable storage option. Because these clamps are designed to accommodate a range of tool diameters, your equipment will remain firmly secured while traveling.\n\nSturdy Design\n\nThe NSR4463 clamps are strong and long-lasting since they are made of heavy-duty rubber. Because of their resistance to tearing, cracking, and UV damage, your equipment will be safely stored for a very long time—even in the most adverse circumstances.\n\nPerformance in Every Weather\n\nThese clamps function dependably in both hot and cold areas since they are designed to endure extreme temperatures. To extend their lifespan, it is best to keep them out of direct sunlight for extended periods of time.\n\nDesigning to Save Space\n\nThese clamps are perfect for mounting to roll cages, roof racks, or cargo spaces because of their small size and space-saving design. Organize your tools without sacrificing storage capacity.\n\nSimple Installation\n\nInstalling the NSR4463 rubber clamps is quite simple and doesn't involve any drilling. They provide a rapid and practical mounting solution; just clamp them firmly into position, and they will be ready to hold your tools in a matter of seconds.",
    "specifications": {
      "Tool Diameter Range": "Axes, Shovels, Rakes",
      "Material": "Heavy-Duty Rubber",
      "Weather Resistance": "Tear, Crack, UV Resistant",
      "Temperature Range": "Extreme Temperatures",
      "Design": "Space-Saving",
      "Installation": "No-Drill, Easy Clamp"
    }
  },
  {
    "id": 37,
    "model": "VP21037",
    "name": "VIRIX PRO NSR64241 Rubber Clamps",
    "images": [
      "/images/portfolio/VP21037/VP21037.jpg",
      "/images/portfolio/VP21037/VP21037 (2).jpg",
      "/images/portfolio/VP21037/VP21037 (3).jpg",
      "/images/portfolio/VP21037/VP21037 (4).jpg"
    ],
    "description": "Safekeeping of Large Tools\n\nAxes, shovels, and other larger equipment with diameters ranging from 64mm to 240mm (2.5\" to 9.5\") can be safely mounted with the VIRIX PRO NSR64241 Rubber Clamps. These clamps keep your big tools securely kept and within easy reach, making them ideal for trucks, off-road vehicles, and outdoor excursions.\n\nHeavy-Duty Building\n\nThe heavy-duty, transportation-grade rubber used to make the NSR64241 clamps gives them exceptional durability against UV ray damage, ripping, and cracking. Even in the most hostile conditions, their durable construction guarantees durability and protection.\n\nPerformance in Every Weather\n\nThese clamps are made to last in harsh environments and work well in both hot and cold climates. They can tolerate temperatures between -40°C and +80°C (-40°F and 176°F), which makes them appropriate for year-round use.\n\nDesigning to Save Space\n\nEven though these clamps can hold large tools, their tiny design lets you place them on roll cages, roof racks, or cargo areas without taking up valuable storage space in your car.\n\nSimple Installation\n\nInstalling the NSR64241 clamps is simple and doesn't require drilling. They are quick and easy to attach on your car for instant use because they have pre-drilled holes for secure bolting (bolt not provided).",
    "specifications": {
      "Tool Diameter Range": "64mm to 240mm (2.5\" to 9.5\")",
      "Material": "Transportation-Grade Rubber",
      "Weather Resistance": "UV, Rip, Crack Resistant",
      "Temperature Range": "-40°C to +80°C (-40°F to 176°F)",
      "Design": "Compact and Space-Saving",
      "Installation": "No-Drill, Pre-Drilled Holes"
    }
  },
  {
    "id": 38,
    "model": "VP21038",
    "name": "VIRIX PRO NSR7089 Rubber Clamps",
    "images": [
      "/images/portfolio/VP21038/VP21038.jpg",
      "/images/portfolio/VP21038/VP21038 (2).jpg",
      "/images/portfolio/VP21038/VP21038 (3).jpg",
      "/images/portfolio/VP21038/VP21038 (4).jpg"
    ],
    "description": "Heavy-Duty Tool Storage\n\nThe VIRIX PRO NSR7089 Rubber Clamps provide a secure and reliable mounting solution for massive tools ranging from 70mm to 83mm in diameter, including axes, shovels, and more. Perfect for off-road vehicles, trucks, and outdoor enthusiasts, these clamps keep your tools secure and easily accessible.\n\nDurable Construction\n\nConstructed from heavy-duty rubber, the NSR7089 clamps are built to withstand tough environments. They resist tearing, cracking, and UV damage, ensuring long-lasting performance and protection for your tools.\n\nAll-Weather Performance\n\nDesigned to work in all conditions, these clamps are reliable in both hot and cold climates. They function well in temperatures from -40°C to +80°C (-40°F to 176°F), ensuring your tools stay securely in place regardless of the weather.\n\nSpace-Saving Design\n\nThanks to their compact design, the NSR7089 clamps mount easily to roll cages, roof racks, or cargo areas without taking up extra space. They allow you to save valuable storage while still securing your tools.\n\nEasy, Secure Grip\n\nWith quick installation and a secure grip, these clamps hold up to 50 lbs and ensure that your tools (under 83mm diameter) stay in place. The no-drill design allows you to mount them quickly, giving you more time for your outdoor adventures.",
    "specifications": {
      "Tool Diameter Range": "70mm to 83mm",
      "Material": "Heavy-Duty Rubber",
      "Weather Resistance": "Tear, Crack, UV Resistant",
      "Temperature Range": "-40°C to +80°C (-40°F to 176°F)",
      "Design": "Compact and Space-Saving",
      "Installation": "No-Drill, Easy Mounting"
    }
  }
]
